{"keras_version": "2.0.4", "config": {"layers": [{"config": {"batch_input_shape": [null, 28, 140, 1], "sparse": false, "dtype": "float32", "name": "input_27"}, "inbound_nodes": [], "name": "input_27", "class_name": "InputLayer"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_76", "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["input_27", 0, 0, {}]]], "name": "conv2d_76", "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_71", "padding": "valid", "pool_size": [2, 2]}, "inbound_nodes": [[["conv2d_76", 0, 0, {}]]], "name": "max_pooling2d_71", "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_77", "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_71", 0, 0, {}]]], "name": "conv2d_77", "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_72", "padding": "valid", "pool_size": [2, 2]}, "inbound_nodes": [[["conv2d_77", 0, 0, {}]]], "name": "max_pooling2d_72", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_22"}, "inbound_nodes": [[["max_pooling2d_72", 0, 0, {}]]], "name": "flatten_22", "class_name": "Flatten"}, {"config": {"rate": 0.3, "trainable": true, "name": "dropout_25"}, "inbound_nodes": [[["flatten_22", 0, 0, {}]]], "name": "dropout_25", "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_52", "use_bias": true, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "name": "dense_52", "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_53", "use_bias": true, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "name": "dense_53", "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_54", "use_bias": true, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "name": "dense_54", "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_55", "use_bias": true, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "name": "dense_55", "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_56", "use_bias": true, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "name": "dense_56", "class_name": "Dense"}], "name": "model_22", "input_layers": [["input_27", 0, 0]], "output_layers": [["dense_52", 0, 0], ["dense_53", 0, 0], ["dense_54", 0, 0], ["dense_55", 0, 0], ["dense_56", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}