{"backend": "tensorflow", "config": {"output_layers": [["y1", 0, 0], ["y2", 0, 0], ["y3", 0, 0], ["y4", 0, 0], ["y5", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 28, 140, 1], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "name": "conv2d_4", "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_4", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_4", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.22}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 256, "name": "dense_1"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.22}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 1024, "name": "dense_2"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 11, "name": "y1"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "y1", "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 11, "name": "y2"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "y2", "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 11, "name": "y3"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "y3", "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 11, "name": "y4"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "y4", "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 11, "name": "y5"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "y5", "class_name": "Dense"}], "name": "model_1"}, "class_name": "Model", "keras_version": "2.0.4"}